In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('cars.csv')
df

      Name  Model  Price
0    Honda   2019  200.0
1  Hyundai   2017  182.0
2   Toyota   2019    NaN
3   Mehran   2001  210.0
4  Corolla   2020  199.0

In [4]:
headers = ['Cars' , 'Year', 'Rate']

In [6]:
df.columns = headers
df

      Cars  Year   Rate
0    Honda  2019  200.0
1  Hyundai  2017  182.0
2   Toyota  2019    NaN
3   Mehran  2001  210.0
4  Corolla  2020  199.0

In [8]:
missing = df.isnull().sum()
missing

Cars    0
Year    0
Rate    1
dtype: int64

In [34]:
avg = df.Year.astype("float").mean(axis=0)
avg

2015.2

In [35]:
df.replace(np.nan, avg)

      Cars  Year                                               Rate
0    Honda  2019                                              200.0
1  Hyundai  2017                                              182.0
2   Toyota  2019  <bound method NDFrame._add_numeric_operations....
3   Mehran  2001                                              210.0
4  Corolla  2020                                              199.0

In [36]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Carol'], 'Age': [25, 30, 35]})

# Write the DataFrame to a CSV file
df.to_csv('my_data.csv', sep=',')

# The CSV file will be created in the current directory.

In [37]:
cities = pd.DataFrame([['Sacramento', 'California'], ['Miami', 'Florida']], columns=['City', 'State'])
cities.to_csv('cities.csv')

In [39]:
newf = pd.read_csv('cities.csv')
newf

   Unnamed: 0        City       State
0           0  Sacramento  California
1           1       Miami     Florida

In [41]:
newf.rename(columns = {'City' : 'Sheher' },inplace=True)
newf

   Unnamed: 0      Sheher       State
0           0  Sacramento  California
1           1       Miami     Florida

In [42]:
newf.to_csv('cities.csv', sep = ',')

In [44]:
newf.loc[0, 'Sheher'] = 'Lahore'
newf

   Unnamed: 0  Sheher       State
0           0  Lahore  California
1           1   Miami     Florida

In [45]:
newf.to_csv('cities.csv', sep = ',')